package Model;

public class SpecialDays {
    public static String[][] days = new String[12][31];

    public static void Init() {
        Farvardin();
        Ordibehesht();
        Khordad();
        Tir();
        Mordad();
        Shahrivar();
        Mehr();
        Aban();
        Azar();
        Dey();
        Bahman();
        Esfand();
    }

    private static void Farvardin() {
        days[0][0] = "عید نوروز";
        days[0][1] = "عيد نوروز-آغاز عمليات فتح المبين-تهاجم رژيم شاهي به مدرسه فيضيه قم";
        days[0][2] = "عید نوروز";
        days[0][3] = "عید نوروز";
        days[0][11] = "روز جمهوري اسلامي ايران";
        days[0][12] = "روز طبيعت";
        days[0][17] = "روز سلامتي (روز جهاني بهداشت)";
        days[0][18] = "شهادت آيت الله سيد محمد باقر صدر";
        days[0][19] = "روز ملی فناوری هسته ای";
        days[0][20] = "شهادت امير سپهبد علي صياد شيرازي";
        days[0][24] = "روز بزرگداشت عطار نيشابوري";
        days[0][28] = "روز ارتش جمهوري اسلامي ايران";
        days[0][29] = "روز وقف";
    }

    private static void Ordibehesht() {
        days[1][0] = "روز بزرگداشت سعدي";
        days[1][1] = "تاسيس سپاه پاسداران-سالروز انقلاب فرهنگي-روز زمين پاک";
        days[1][2] = "روز بزرگداشت شيخ بهايي";
        days[1][4] = "شکست حمله نظامي آمريکا در طبس";
        days[1][8] = "روز شورا ها";
        days[1][9] = "روز ملی خلیج فارس-آغاز عمليات بيت المقدس";
        days[1][11] = "شهادت استاد مطهري-روز معلم-روز جهاني کارگر";
        days[1][14] = "روز بزرگداشت شيخ صدوق";
        days[1][17] = "روز اسناد ملي";
        days[1][18] = "روز جهاني صليب سرخ";
        days[1][23] = "لغو امتياز تنباکو";
        days[1][24] = "روز بزرگداشت فردوسي";
        days[1][25] = "روز جهاني خانواده";
        days[1][27] = "روز بزرگ داشت حکيم عمر خيام-روز جهاني ارتباطات";
        days[1][28] = "روز جهاني موزه و ميراث فرهنگي";
    }

    private static void Khordad() {
        days[2][0] = "روز بهره وري-روز بزرگداشت ملاصدرا-روز جهاني توسعه فرهنگي";
        days[2][2] = "فتح خرمشهر درعمليات بيت المقدس-روز مقاومت، ایثار و پيروزي";
        days[2][3] = "روز دزفول (روز مقاومت و پایداری)";
        days[2][6] = "افتتاح اولین دوره مجلس شورای اسلامی";
        days[2][13] = "رحلت امام خميني (ره) رهبر کبير انقلاب-انتخاب آيت الله خامنه اي به رهبري";
        days[2][14] = "قيام خونين 15 خرداد-روز جهانی محيط زيست";
        days[2][15] = "روز جهانی محيط زيست";
        days[2][19] = "شهادت آيت الله سعيدي-روز جهانی صنايع دستی";
        days[2][20] = "روز جهانی صنايع دستی";
        days[2][25] = "شهادت سربازان دلير اسلام: بخارائي، اماني، صفار هرندي و نيک نژاد";
        days[2][27] = "روز جهاني بيابان زدايي";
        days[2][28] = "درگذشت دکتر علي شريعتي";
        days[2][30] = "شهادت دکتر مصطفي چمران";
    }

    private static void Tir() {
        days[3][0] = "صدور فرمان تاسيس سازمان تبليغات اسلامي-روز اصناف";
        days[3][5] = "روز جهاني مبارزه با مواد مخدر";
        days[3][6] = "شهادت آيت الله دکتر بهشتي توسط منافقين-روز قوه قضاييه";
        days[3][7] = "روز مبارزه با سلاح هاي شيميايي و ميکروبي";
        days[3][9] = "روز صنعت و معدن";
        days[3][10] = "شهادت آيت الله صدوقي به دست منافقين";
        days[3][11] = "روز افشای حقوق بشر امریکایی-سقوط هواپيما مسافربري ايران توسط آمريکا";
        days[3][12] = "مبارزه با بيماري هاي مشترک انسان و حيوان";
        days[3][13] = "روز قلم";
        days[3][15] = "روز ماليات";
        days[3][20] = "روز عفاف و حجاب";
        days[3][22] = "گشایش نخستین مجلس خبرگان رهبری";
        days[3][24] = "روز بهزيستي و تامين اجتماعي";
        days[3][25] = "تاسیس شورای نگهبان";
        days[3][26] = "پذيرش قطعنامه 598 از سوي ايران";
    }

    private static void Mordad() {
        days[4][4] = "سالروز عمليت غرور آفرين مرصاد-اولین نماز جمعه در سال 1358";
        days[4][5] = "روز ترويج آموزش هاي فني و حرفه اي";
        days[4][7] = "روز بزرگداشت شيخ شهاب الدين سهروردي";
        days[4][8] = "روز اهداي خون";
        days[4][13] = "صدور فرمان مشروطيت";
        days[4][15] = "تشکيل جهاد دانشگاهي";
        days[4][16] = "روز خبرنگار";
        days[4][22] = "روز مقاومت اسلامی";
        days[4][25] = "آغاز بازگشت آزادگان به ميهن اسلامي";
        days[4][27] = "کودتاي آمريکا براي باز گرداندن شاه ";
        days[4][28] = "اعلام آغاز آتش ‏بس ميان ايران و عراق";
        days[4][29] = "روز بزرگداشت علامه مجلسي";
        days[4][30] = "روز جهاني مسجد";
    }

    private static void Shahrivar() {
        days[5][0] = "روز پزشک";
        days[5][1] = "آغاز هفته دولت";
        days[5][3] = "روز کارمند";
        days[5][4] = "روز داروسازي-روز بزرگداشت محمد بن زکرياي رازي";
        days[5][7] = "انفجار دفتر نخست وزيري به دست منافقين-شهادت مظلومانه شهيدان رجايي و با هنر-روز مبارزه با تروريسم";
        days[5][9] = "روز بانکداري اسلامي-تصويب قانون عليات بانکي بدون ريا";
        days[5][10] = "روز صنعت چاپ";
        days[5][12] = "روز تعاون-روز بزرگداشت ابو ريحان بيروني";
        days[5][13] = "شهادت آيت الله قدوسي-شهادت سرتيپ وحيد دستجردي ";
        days[5][16] = "قيام 17 شهريور-کشتار مردم به دست ماموران شاهي";
        days[5][18] = "شهادت آيت الله سيد محمود طالقان";
        days[5][19] = "شهادت آيت االه مدني به دست منافقين";
        days[5][20] = "روز سينما";
        days[5][26] = "روز شعر و ادب فارسي-روز بزرگداشت استاد شهريار";
        days[5][29] = "روز گفتگوي تمدن ها";
        days[5][30] = "آغاز جنگ تحميلي-آغاز هفته دفاع مقدس";
    }

    private static void Mehr() {
        days[6][4] = "شکست حصر آبادان در عمليات ثامن الائمه";
        days[6][5] = "روز جهاني جهانگردي";
        days[6][6] = "روز آتش نشاني و ايمني";
        days[6][7] = "شهادت سرداران فلاحي ،فکوري ،نامجو ،کلاهدوز و جهان آرا-روز بزرگداشت مولوي";
        days[6][8] = "روز همبستگي و همدردي با کودکان فلسطيني-روز جهاني ناشنوايان";
        days[6][9] = "روز جهاني مستضعفان-روز جهاني سالمندان";
        days[6][12] = "هجرت امام خميني (ره) از عراق به پاريس-روز نيروي انتظامي";
        days[6][13] = "روز دامپزشکي";
        days[6][15] = "روز ملی کودک";
        days[6][19] = "روز بزرگداشت حافظ-روز اسکن معلولين و سالمندان-روز ملي کاهش اثرات بلاياي طبيعي";
        days[6][22] = "شهادت آيت الله اشرفي توسط منافقين-روز جهاني استاندارد";
        days[6][23] = "روز پيوند اولياء و مربيان-روز جهاني نابينايان (عصاي سفيد)";
        days[6][25] = "روز تربيت بدني و ورزش";
        days[6][28] = "روز صادرات";
    }

    private static void Aban() {
        days[7][0] = "روز آمار و برنامه ريزي";
        days[7][3] = "افشاگري امام خميني عليه کاپيتولاسيون";
        days[7][7] = "شهادت محمد حسين فهميده-روز نوجوان-روز بسيج دانش آموزي";
        days[7][9] = "شهادت آيت الله طباطبايي به دست منافقين";
        days[7][12] = "تبعید امام خمینی(ره) به ترکیه-روز دانش آموز-تسخير لانه جاسوسی آمريکا-روز ملّی مبارزه با استکبار جهانی";
        days[7][18] = "روز ملي کيفيت";
        days[7][23] = "روز کتاب و کتابخوان-بزرگدشت آيت الله علامه طباطبايي";
        days[7][28] = "روز جهانی کودک";
        days[7][29] = "روز جهانی کودک";
    }

    private static void Azar() {
        days[8][4] = "روز بسيج مستضعفين-تشکيل بسج مستضعفين به فرمان امام خميني";
        days[8][6] = "روز نيروي دريايي-شهادت شهید هسته ای محسن فخری زاده";
        days[8][8] = "روز بزرگداشت شيخ مفيد";
        days[8][9] = "شهادت آيت الله سيد حسن مدرس-روز مجلس";
        days[8][10] = "شهادت ميرزا کوچک خان جنگلي";
        days[8][11] = "تصويب قانون اساسي جمهوري اسلامي ايران";
        days[8][12] = "روز بيمه-روز جهاني معلولين";
        days[8][15] = "روز دانشجو";
        days[8][17] = "معرفي عراق به عنوان مسئول و آغاز گر جنگ";
        days[8][18] = "تشکيل شوراي عالي انقلاب فرهنگي";
        days[8][19] = "شهادت آيت الله دستغيب به دست منافقين";
        days[8][24] = "روز پژوهش";
        days[8][25] = "روز حمل و نقل";
        days[8][26] = "شهادت آيت الله دکتر محمد مفتح-روز وحدت حوزه و دانشگاه";
    }

    private static void Dey() {
        days[9][3] = "ميلاد حضرت مسيح (ع)";
        days[9][6] = "شهادت آيت الله غفاري توسط رژيم پهلوي-سالروز تشکيل نهضت سواد آموزي";
        days[9][8] = "روز بصیرت و میثاق امت با ولایت";
        days[9][11] = "آغاز سال جديد ميلادي";
        days[9][12] = "روز جهانی مقاومت-شهادت سردار قاسم سلیمانی";
        days[9][13] = "روز جهاد کشاورزي";
        days[9][19] = "شهادت ميرزا تقي خان امير کبير";
        days[9][21] = "تشکيل شوراي انقلاب به فرمان امام خميني";
        days[9][25] = "فرار شاه معدوم";
        days[9][26] = "شهادت نواب صفوي، طهماسبي، برادران واحدي و ذوالقدر";
        days[9][28] = "روز غزه";
    }

    private static void Bahman() {
        days[10][11] = "بازگشت حضرت امام خميني (ره)";
        days[10][13] = "روز فناوری فضایی";
        days[10][16] = "روز خانواده";
        days[10][18] = "روز نيروي هوايي";
        days[10][20] = "شکسته شدن حکومت نظامي به فرمان امام";
        days[10][21] = "پيروزي انقلاب اسلامي ايران";
    }

    private static void Esfand() {
        days[11][2] = "روز تجليل از اسرا و مفقودان";
        days[11][4] = "روز بزرگداشت خواجه نصير الدين طوسي-روز مهندسي";
        days[11][7] = "روز امور تربيتي";
        days[11][8] = "روز ملي حمايت از حقوق مصرف کنندگان";
        days[11][13] = "روز احسان و نيکوکاري";
        days[11][14] = "روز درختکاري";
        days[11][19] = "روز راهیان نور";
        days[11][21] = "روز بزرگداشت شهدا-روز تکریم مادران و همسران شهدا-روز بزرگداشت شهدا";
        days[11][24] = "بمباران شيميايي حلبچه توسط ارتش بعث";
        days[11][28] = "روز ملي شدن صنعت نفت ايران";
    }
}
